---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined
source: html/bdd58bfd-3440-75c0-8d79-995713c75711.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined

Defines parameters for parameterized user defined structural section.

## Syntax (C#)
```csharp
public class StructuralSectionUserDefined : StructuralSectionRectangular
```